yii2/backend/models/Handel.php

	public function Zshen($id)
	{
		$UserDatabase = new UserDatabase();
		$UserDatabase = UserDatabase::findOne($id);
		$UserDatabase->u_status = 1;
		$bool = $UserDatabase->save();
---
UPDATE `user` SET `u_status`='1' WHERE (`u_id`=14) AND (`u_name`='èŒƒå°é¾\™')