yii2/backend/controllers/AccountController.php

	public function actionLandlord(){
		$query = User::find();

        $pagination = new Pagination([
            'defaultPageSize' => 2,
            'totalCount' => $query->where('u_type = 1')->count(),
        ]);

        $countries = $query->where('u_type = 1')->orderBy('u_id DESC')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `user` WHERE u_type = 1
SELECT * FROM `user` WHERE u_type = 1 ORDER BY `u_id` DESC LIMIT 2 OFFSET 2

	public function actionRenter(){
		$query = User::find();

        $pagination = new Pagination([
            'defaultPageSize' => 2,
            'totalCount' => $query->where('u_type = 0')->count(),
        ]);

        $countries = $query->where('u_type = 0')->orderBy('u_id DESC')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `user` WHERE u_type = 0
SELECT * FROM `user` WHERE u_type = 0 ORDER BY `u_id` DESC LIMIT 2

	public function actionRentercheck(){
		$query = User::find();

        $pagination = new Pagination([
            'defaultPageSize' => 2,
            'totalCount' => $query->where('u_type = 0')->count(),
        ]);

        $countries = $query->where('u_type = 0')->orderBy('u_id DESC')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `user` WHERE u_type = 0
SELECT * FROM `user` WHERE u_type = 0 ORDER BY `u_id` DESC LIMIT 2 OFFSET 2