yii2/backend/controllers/ActiveController.php

	public function actionIndex(){

		$query = Active::find();

        $pagination = new Pagination([
            'defaultPageSize' => 3,
            'totalCount' => $query->count(),
        ]);
        $countries = $query->orderBy('act_id DESC')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `active`
SELECT * FROM `active` ORDER BY `act_id` DESC LIMIT 3 OFFSET 3