yii2/backend/controllers/CommentController.php

	public function actionIndex(){

		$query = Comment::find()->where(['c_status'=>1]);
        $pagination = new Pagination([
            'defaultPageSize' => 3,
            'totalCount' => $query->count(),
        ]);
        $countries = $query->orderBy('c_id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `comment` WHERE `c_status`=1
SELECT * FROM `comment` WHERE `c_status`=1 ORDER BY `c_id` LIMIT 3

	public function actionCommentcheck(){
		$query = Comment::find()->where(['c_status' => 0]);

        $pagination = new Pagination([
            'defaultPageSize' => 3,
            'totalCount' => $query->count(),
        ]);

        $countries = $query->orderBy('c_id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `comment` WHERE `c_status`=0
SELECT * FROM `comment` WHERE `c_status`=0 ORDER BY `c_id` LIMIT 3