yii2/backend/controllers/HouseController.php

	public function actionIndex(){

		$query = Housese::find()->where(['h_ischeck' => 1]);

        $pagination = new Pagination([
            'defaultPageSize' => 3,
            'totalCount' => $query->count(),
        ]);

        $countries = $query->orderBy('h_id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `housese` WHERE `h_ischeck`=1
SELECT * FROM `housese` WHERE `h_ischeck`=1 ORDER BY `h_id` LIMIT 3 OFFSET 3

	public function actionHousecheck(){
		$query = Housese::find()->where(['h_ischeck' => 0]);

        $pagination = new Pagination([
            'defaultPageSize' => 3,
            'totalCount' => $query->count(),
        ]);

        $countries = $query->orderBy('h_id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `housese` WHERE `h_ischeck`=0
SELECT * FROM `housese` WHERE `h_ischeck`=0 ORDER BY `h_id` LIMIT 3